app/mailers/user_mailer.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
def reset_password_email(user)
    @user = User.find(user.id)