app/views/shared/_unbookmark.html.erb

<%= link_to recipe_bookmarks_path(current_user.bookmarks.find_by(recipe_id: recipe.id)), id: "js-bookmark-button-for-recipe-#{recipe.id}", method: :delete do %>
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."recipe_id" = $2 LIMIT $3  [["user_id", 1], ["recipe_id", 1], ["LIMIT", 1]]