app/controllers/bodies_controller.rb

INSERT INTO "bodies" ("user_id", "sex", "age", "weight", "height", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 3], ["sex", 0], ["age", 27], ["weight", 89], ["height", 178], ["created_at", "2024-05-19 14:14:36.611367"], ["updated_at", "2024-05-19 14:14:36.611367"]]
INSERT INTO "goals" ("user_id", "body_id", "goal_weight", "volume_of_activity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["body_id", 2], ["goal_weight", 80], ["volume_of_activity", 0], ["created_at", "2024-05-19 14:14:36.646749"], ["updated_at", "2024-05-19 14:14:36.646749"]]
---
  def create
    @body = @user.build_body(body_params)
    @body.goal.user_id = @user.id
    begin
    if @body.save!

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:user_id])