app/controllers/bookmarks_controller.rb

    def create
        @recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        @recipe = current_user.bookmarks.find(params[:recipe_id]).recipe
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]