app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test"], ["LIMIT", 1]]

  def edit
    @token = params[:id]
    @user = User.load_from_reset_password_token(params[:id])
    not_authenticated if @user.blank?
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = 'Fwiaym8Q_FRQhbQ7sDeT' ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def update
    @token = params[:id]
    @user = User.load_from_reset_password_token(params[:id])

    if @user.blank?
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = 'Fwiaym8Q_FRQhbQ7sDeT' ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]