app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    if Recipe.exists?(individual_id: @recipe.individual_id)
      @recipe = Recipe.find_by(individual_id: @recipe.individual_id)
      redirect_to recipe_path(id: @recipe.id)
    else
      agent = Mechanize.new
      page = agent.get(@recipe.individual_id)
      @ingredients = page.search(".name").map(&:text)
      @amounts = page.search(".amount").map(&:text)
      @combined = @ingredients.zip(@amounts).map{ |pair| pair.join(": ") }

      combined_text = @combined.join(",")
      chat_api = OpenAi::ChatApi.new("totalcalories,proteins,carbhydrates,fats,salts,fibersの数値だけ答えてください。各項目の前に[,]つけて。例: 100,200,300,400,500,600")
      chat_responce = chat_api.chat(combined_text)
      @combined = chat_responce.split(",")
      @recipe = Recipe.new(
        individual_id: @recipe.individual_id,
        calories: @combined[0],
        proteins: @combined[1],
        carbhydarates: @combined[2],
        fats: @combined[3],
        salts: @combined[4],
        fibers: @combined[5])
        if @recipe.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."individual_id" = $1 LIMIT $2  [["individual_id", "https://cookpad.com/recipe/2589170"], ["LIMIT", 1]]
SELECT 1 AS one FROM "recipes" WHERE "recipes"."individual_id" = $1 LIMIT $2  [["individual_id", "https://cookpad.com/recipe/2589170"], ["LIMIT", 1]]
INSERT INTO "recipes" ("individual_id", "created_at", "updated_at", "calories", "proteins", "carbhydarates", "fats", "salts", "fibers") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def details
    @recipe = Recipe.find(individual_id: params[:individual_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]