app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("individual_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["individual_id", "https://cookpad.com/recipe/2589170"], ["created_at", "2024-05-22 14:27:14.414555"], ["updated_at", "2024-05-22 14:27:14.414555"]]
---
  def create
    # ①URLを入力
    # ②URL保存時、重複しているかどうかを確認する
    # ③重複している場合は保存しない、DBから情報を呼び出す
    # ④重複していない場合は保存する
    # ⑤保存したURLを元に、材料と分量を取得する
    # ⑥取得した材料と分量を元に、OpenAIにリクエストを送る
    # ⑦OpenAIからのレスポンスを元に、レシピを作成する
    # ⑧保存したURLに紐づける形で、カロリーや含有量を保存する
    @recipe = Recipe.new(recipe_params)
    existing_recipe = Recipe.find_by(individual_id: @recipe.individual_id)

    if existing_recipe
      redirect_to recipes_result_path(individual_id: existing_recipe.individual_id)
    elsif @recipe.save