app/models/user.rb

INSERT INTO "bookmarks" ("user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["recipe_id", 1], ["created_at", "2024-07-01 13:39:41.373734"], ["updated_at", "2024-07-01 13:39:41.373734"]]
---
  def bookmark(recipe)
    bookmarks_recipes << recipe

DELETE FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."recipe_id" = $2  [["user_id", 1], ["recipe_id", 1]]
---
  def unbookmark(recipe)
    bookmarks_recipes.delete(recipe)